# kopo_product_volume 테이블을 불러온 후 다음 과정을 진행 하세요. 모든 주차에 이동평균을 window 5로 설정하여 구한 후 (빈 셀은 존재하는 날개에 대해서만) RATIO 컬럼을 추가하여 VOLUME/이동평균 값으로 넣으세요

#### 이동평균 구간 정의

In [13]:
import math
#이동평균 구간
order = 5
# 앞뒤로 비어있게될 구간 크기
suborder = math.floor(order/2)

#### 이동평균 전체 함수

In [32]:
def sub_function(data):
    data = data.reset_index(drop=True)
    data["MA"] = data["VOLUME"].rolling(window = 5, center = True).mean()
    postList = []
    preList = []
    maxLength = len(data)
    
    for i in range(0,suborder):
        postList.append(data["VOLUME"][(maxLength-1)-(suborder+i):maxLength].mean())
        data.loc[maxLength-i-1,"MA"] = postList[i]
    
    for i in range(0,suborder):
        preList.append(data["VOLUME"][0:suborder+i+1].mean())
        data.loc[i,"MA"] = preList[i]
        
    return data

#### 이동평균 함수

In [4]:
def sub_function(data):
    data["MA"] = data["VOLUME"].rolling(window = 5, center = True).mean()
    return data

#### 뒤에 이동평균 함수

In [17]:
def sub_function2(data):
    data = data.reset_index(drop=True)
    postList = []
    maxLength = len(data)
    #print(data)
    #print(maxLength)
    for i in range(0,suborder):
        postList.append(data["VOLUME"][(maxLength-1)-(suborder+i):maxLength].mean())
        data.loc[maxLength-i-1,"MA"] = postList[i]
    return data

#### 앞에 이동평균 함수

In [6]:
def sub_function3(data):
    data = data.reset_index(drop=True)
    preList = []
    for i in range(0,suborder):
        preList.append(data["VOLUME"][0:suborder+i+1].mean())
        data.loc[i,"MA"] = preList[i]
    return data

#### 데이터 불러오기

In [8]:
import pandas as pd
from sqlalchemy import create_engine 

# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM kopo_product_volume2', engine)

#### 컬럼명 대문자 변환

In [9]:
#컬럼 재정의(대문자로 바꾸는 방법)
customerData.columns = [x.upper() for x in customerData.columns]
customerData.head()

  REGIONID PRODUCTGROUP YEARWEEK  VOLUME
0      A01       ST0002   201512  151750
1      A01       ST0001   201520  645626
2      A01       ST0002   201520  125863
3      A01       ST0001   201515  810144
4      A01       ST0002   201515  128999

#### 정렬하기(sort)

In [10]:
customerData = customerData.sort_values(["REGIONID","PRODUCTGROUP","YEARWEEK"], ascending=[True,True,True]) 
#컬럼1에대해서는 오름차순, 커럼2에 대해서는 내림차순
customerData.head()

   REGIONID PRODUCTGROUP YEARWEEK  VOLUME
36      A01       ST0001   201501  513598
24      A01       ST0001   201502  438251
30      A01       ST0001   201503  420290
38      A01       ST0001   201504  458431
26      A01       ST0001   201505  482381

#### 인덱스 초기화

In [11]:
customerData = customerData.reset_index(drop=True)
customerData.head()

  REGIONID PRODUCTGROUP YEARWEEK  VOLUME
0      A01       ST0001   201501  513598
1      A01       ST0001   201502  438251
2      A01       ST0001   201503  420290
3      A01       ST0001   201504  458431
4      A01       ST0001   201505  482381

### group 묶어 이동평균 구하기

In [33]:
groupResult = customerData.groupby(["REGIONID","PRODUCTGROUP"]).apply(sub_function)
groupResult.head(2)

                        REGIONID PRODUCTGROUP YEARWEEK  VOLUME             MA
REGIONID PRODUCTGROUP
A01      ST0001       0      A01       ST0001   201501  513598  457379.666667
                      1      A01       ST0001   201502  438251  457642.500000

In [19]:
groupResult2 = groupResult.groupby(["REGIONID","PRODUCTGROUP"]).apply(sub_function2)
groupResult2.head()

                        REGIONID PRODUCTGROUP YEARWEEK  VOLUME        MA
REGIONID PRODUCTGROUP
A01      ST0001       0      A01       ST0001   201501  513598       NaN
                      1      A01       ST0001   201502  438251       NaN
                      2      A01       ST0001   201503  420290  462590.2
                      3      A01       ST0001   201504  458431  473953.0
                      4      A01       ST0001   201505  482381  510381.2

In [21]:
groupResult3 = groupResult2.groupby(["REGIONID","PRODUCTGROUP"]).apply(sub_function3)
groupResult3.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: 'REGIONID' is both a column name and an index level.
Defaulting to column but this will raise an ambiguity error in a future version
  """Entry point for launching an IPython kernel.
C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: 'PRODUCTGROUP' is both a column name and an index level.
Defaulting to column but this will raise an ambiguity error in a future version
  """Entry point for launching an IPython kernel.

                        REGIONID PRODUCTGROUP YEARWEEK  VOLUME             MA
REGIONID PRODUCTGROUP
A01      ST0001       0      A01       ST0001   201501  513598  457379.666667
                      1      A01       ST0001   201502  438251  457642.500000
                      2      A01       ST0001   201503  420290  462590.200000
                      3      A01       ST0001   201504  458431  473953.000000
                      4      A01       ST0001   201505  482381  510381.200000

In [23]:
groupResult3 = groupResult3.reset_index(drop=True)
groupResult3.head()

  REGIONID PRODUCTGROUP YEARWEEK  VOLUME             MA
0      A01       ST0001   201501  513598  457379.666667
1      A01       ST0001   201502  438251  457642.500000
2      A01       ST0001   201503  420290  462590.200000
3      A01       ST0001   201504  458431  473953.000000
4      A01       ST0001   201505  482381  510381.200000

#### RATIO = VOLUME/이동평균

In [27]:
groupResult3["RATIO"] = groupResult3["VOLUME"]/groupResult3["MA"]
groupResult3.head()

  REGIONID PRODUCTGROUP YEARWEEK  VOLUME             MA     RATIO
0      A01       ST0001   201501  513598  457379.666667  1.122914
1      A01       ST0001   201502  438251  457642.500000  0.957627
2      A01       ST0001   201503  420290  462590.200000  0.908558
3      A01       ST0001   201504  458431  473953.000000  0.967250
4      A01       ST0001   201505  482381  510381.200000  0.945139

#### 데이터 저장

In [34]:
groupResult.to_csv("d:/groupResult4.csv", index=False)